artemopolus/stm32cubemx_gen/board_projects/afina_dev/afina_dev.ioc
#MicroXplorer Configuration settings - do not modify
Dma.SPI1_TX.1.Priority=DMA_PRIORITY_LOW
RCC.USART1Freq_Value=108000000
USART2.IPParameters=VirtualMode-Asynchronous
SPI4.VirtualType=VM_MASTER
SPI1.VirtualType=VM_MASTER
FATFS0.BSP.api=Unknown
VP_FATFS_VS_SDIO.Mode=SDIO
Dma.SPI1_TX.1.FIFOMode=DMA_FIFOMODE_DISABLE
RCC.PLLCLKFreq_Value=216000000
PC12.Signal=SDMMC1_CK
RCC.PLLQCLKFreq_Value=48000000
Dma.SDMMC1_RX.2.Direction=DMA_PERIPH_TO_MEMORY
PD4.Locked=true
USART1.IPParameters=VirtualMode-Asynchronous
PB13.Signal=CAN2_TX
PinOutPanel.RotationAngle=0
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
RCC.LPTIM1Freq_Value=54000000
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.SDMMC1_IRQn=true\:0\:0\:false\:false\:true\:true\:true
Dma.SPI1_RX.0.Direction=DMA_PERIPH_TO_MEMORY
PA4.Mode=Slave_8_bits_External_Synchro
VP_FATFS_VS_SDIO.Signal=FATFS_VS_SDIO
I2C4.Timing=0x20404768
SPI1.Direction=SPI_DIRECTION_2LINES
RCC.I2C4Freq_Value=54000000
PE2.Mode=Full_Duplex_Master
PD4.Signal=GPIO_Output
RCC.APB2TimFreq_Value=216000000
PB6.Signal=USART1_TX
PC7.Signal=DCMI_D1
PH1/OSC_OUT.Signal=RCC_OSC_OUT
PB6.Mode=Asynchronous
SPI1.CalculateBaudRate=54.0 MBits/s
PD0.Signal=CAN1_RX
RCC.SAI2Freq_Value=50000000
PE5.Signal=DCMI_D6
FATFS0.BSP.ip=GPIO
RCC.USART3Freq_Value=54000000
Dma.SDMMC1_TX.3.FIFOMode=DMA_FIFOMODE_ENABLE
Dma.SPI1_TX.1.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
RCC.PLLSAIRCLKFreq_Value=50000000
ProjectManager.ProjectBuild=false
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
FATFS0.BSP.i2caddr=0
Dma.SDMMC1_RX.2.FIFOMode=DMA_FIFOMODE_ENABLE
Dma.SPI1_RX.0.PeriphInc=DMA_PINC_DISABLE
ProjectManager.FirmwarePackage=STM32Cube FW_F7 V1.16.1
MxDb.Version=DB.6.0.10
ProjectManager.BackupPrevious=false
Dma.SPI1_TX.1.Mode=DMA_NORMAL
PC9.Mode=SD_4_bits_Wide_bus
PE2.Signal=SPI4_SCK
PA8.Signal=USB_OTG_FS_SOF
PE13.Mode=Full_Duplex_Master
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PD3.Mode=Slave_8_bits_External_Synchro
ProjectManager.HalAssertFull=false
RCC.MCO2PinFreq_Value=216000000
Dma.SPI1_TX.1.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode
Mcu.Package=LQFP144
PB9.Signal=I2C1_SDA
RCC.SDMMCClockSelection=RCC_SDMMC1CLKSOURCE_CLK48
Dma.SDMMC1_TX.3.MemDataAlignment=DMA_MDATAALIGN_WORD
FATFS0.BSP.solution=PB3
PD5.GPIOParameters=GPIO_Label
Dma.SDMMC1_TX.3.Priority=DMA_PRIORITY_LOW
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
Dma.SDMMC1_RX.2.PeriphBurst=DMA_PBURST_INC4
PC11.Mode=SD_4_bits_Wide_bus
RCC.APB2CLKDivider=RCC_HCLK_DIV2
RCC.CECFreq_Value=32786.88524590164
PF14.Signal=I2C4_SCL
RCC.APB1TimFreq_Value=108000000
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
USB_OTG_FS.IPParameters=VirtualMode
PB13.Mode=CAN_Activate
Dma.SPI1_RX.0.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode
PD5.Locked=true
CAN1.CalculateTimeBit=1481.48
ProjectManager.CustomerFirmwarePackage=
Dma.SPI1_TX.1.Instance=DMA2_Stream5
RCC.PLLSAIQCLKFreq_Value=50000000
CAN1.CalculateTimeQuantum=296.2962962962963
Dma.SDMMC1_RX.2.Instance=DMA2_Stream3
PA5.Mode=Full_Duplex_Master
FATFS0.BSP.STBoard=false
CAN2.CalculateBaudRate=675000
RCC.PLLQoutputFreq_Value=48000000
ProjectManager.ProjectFileName=afina_dev.ioc
PA15.GPIOParameters=GPIO_Label
Mcu.PinsNb=53
PG9.Signal=DCMI_VSYNC
CAN1.IPParameters=CalculateTimeQuantum,BS1,BS2,CalculateTimeBit,CalculateBaudRate
FATFS0.BSP.mode=Input
PD3.Signal=DCMI_D5
CAN1.CalculateBaudRate=675000
CAN2.IPParameters=CalculateTimeQuantum,BS1,BS2,CalculateTimeBit,CalculateBaudRate
PG9.Mode=Slave_8_bits_External_Synchro
PC6.Signal=DCMI_D0
PD1.Signal=CAN1_TX
RCC.UART8Freq_Value=54000000
Dma.SDMMC1_RX.2.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode,FIFOThreshold,MemBurst,PeriphBurst
RCC.APB1CLKDivider=RCC_HCLK_DIV4
Dma.SDMMC1_TX.3.PeriphBurst=DMA_PBURST_INC4
PG10.Signal=DCMI_D2
PA3.Mode=Asynchronous
PA15.Locked=true
Dma.SPI1_TX.1.MemDataAlignment=DMA_MDATAALIGN_BYTE
Mcu.Pin51=VP_FATFS_VS_SDIO
RCC.USART6Freq_Value=108000000
Mcu.Pin52=VP_SYS_VS_Systick
Mcu.Pin50=PB9
PC6.Mode=Slave_8_bits_External_Synchro
PA9.Signal=USB_OTG_FS_VBUS
I2C1.Timing=0x20404768
Dma.SDMMC1_TX.3.MemInc=DMA_MINC_ENABLE
NVIC.DMA2_Stream6_IRQn=true\:0\:0\:false\:false\:true\:false\:true
Mcu.Pin48=PB7
Mcu.Pin49=PB8
Mcu.Pin46=PB4
Mcu.Pin47=PB6
PA0/WKUP.Mode=Asynchronous
DCMI.JPEGMode=DCMI_JPEG_DISABLE
FATFS.BSP.number=1
PA5.Signal=SPI1_SCK
Mcu.Pin40=PD4
Dma.SDMMC1_TX.3.FIFOThreshold=DMA_FIFO_THRESHOLD_FULL
Mcu.Pin41=PD5
PC12.Mode=SD_4_bits_Wide_bus
Mcu.Pin44=PG11
Dma.SDMMC1_RX.2.PeriphDataAlignment=DMA_PDATAALIGN_WORD
Mcu.Pin45=PB3
Mcu.Pin42=PG9
Mcu.Pin43=PG10
ProjectManager.LastFirmware=true
PD1.Mode=CAN_Activate
PE14.Signal=SPI4_MOSI
PA1.Mode=Asynchronous
PE6.Mode=Slave_8_bits_External_Synchro
Mcu.Pin37=PD1
Mcu.Pin38=PD2
Mcu.Pin35=PC12
RCC.I2C1Freq_Value=54000000
Mcu.Pin36=PD0
RCC.PLLI2SPCLKFreq_Value=192000000
SPI1.Mode=SPI_MODE_MASTER
Mcu.Pin39=PD3
FATFS0.BSP.i2creg=
RCC.RNGFreq_Value=48000000
Mcu.Pin30=PA13
Dma.SPI1_RX.0.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
RCC.EthernetFreq_Value=216000000
Mcu.Pin33=PC10
Mcu.Pin34=PC11
Mcu.Pin31=PA14
Dma.SDMMC1_TX.3.PeriphDataAlignment=DMA_PDATAALIGN_WORD
Mcu.Pin32=PA15
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA13.Mode=Serial_Wire
ProjectManager.FreePins=false
Dma.SDMMC1_RX.2.MemDataAlignment=DMA_MDATAALIGN_WORD
RCC.PLLI2SQCLKFreq_Value=192000000
Mcu.Pin26=PA8
Mcu.Pin27=PA9
Mcu.Pin24=PC8
ProjectManager.UnderRoot=false
Mcu.Pin25=PC9
Mcu.Pin28=PA11
Mcu.Pin29=PA12
PC8.Mode=SD_4_bits_Wide_bus
PA4.Signal=DCMI_HSYNC
Mcu.Pin22=PC6
Mcu.Pin23=PC7
Mcu.Pin20=PB12
Mcu.Pin21=PB13
NVIC.ForceEnableDMAVector=true
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.CompilerOptimize=6
PG11.Mode=Slave_8_bits_External_Synchro
PA11.Signal=USB_OTG_FS_DM
ProjectManager.HeapSize=0x200
Mcu.Pin15=PA7
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.Pin16=PF14
Mcu.Pin13=PA5
Mcu.Pin14=PA6
Mcu.Pin19=PE14
Dma.SPI1_RX.0.Priority=DMA_PRIORITY_LOW
ProjectManager.ComputerToolchain=false
Mcu.Pin17=PF15
Mcu.Pin18=PE13
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
Mcu.Pin11=PA3
Mcu.Pin12=PA4
PB8.Mode=I2C
Mcu.Pin10=PA2
PC15/OSC32_OUT.Signal=RCC_OSC32_OUT
PA8.Mode=Activate_SOF_FS
PD2.Signal=SDMMC1_CMD
RCC.I2C2Freq_Value=54000000
FATFS0.BSP.name=Detect_SDIO
Mcu.Family=STM32F7
ProjectManager.MainLocation=Core/Src
PA6.Mode=Slave_8_bits_External_Synchro
RCC.SAI1Freq_Value=50000000
RCC.CortexFreq_Value=216000000
ProjectManager.KeepUserCode=true
FATFS0.BSP.semaphore=
Mcu.UserName=STM32F746ZGTx
Dma.SDMMC1_RX.2.MemInc=DMA_MINC_ENABLE
CAN2.CalculateTimeBit=1481.48
Dma.SDMMC1_TX.3.MemBurst=DMA_MBURST_INC4
PC10.Signal=SDMMC1_D2
SPI4.Direction=SPI_DIRECTION_2LINES
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-MX_DMA_Init-DMA-false-HAL-true,3-SystemClock_Config-RCC-false-HAL-false,4-MX_DCMI_Init-DCMI-false-HAL-true,5-MX_USART1_UART_Init-USART1-false-HAL-true,6-MX_CAN1_Init-CAN1-false-HAL-true,7-MX_CAN2_Init-CAN2-false-HAL-true,8-MX_I2C1_Init-I2C1-false-HAL-true,9-MX_I2C4_Init-I2C4-false-HAL-true,10-MX_SDMMC1_SD_Init-SDMMC1-false-HAL-true,11-MX_SPI1_Init-SPI1-false-LL-true,12-MX_SPI4_Init-SPI4-false-LL-true,13-MX_UART4_Init-UART4-false-HAL-true,14-MX_USART2_UART_Init-USART2-false-HAL-true,15-MX_USB_OTG_FS_PCD_Init-USB_OTG_FS-false-HAL-true,16-MX_FATFS_Init-FATFS-false-HAL-false,0-MX_CORTEX_M7_Init-CORTEX_M7-false-HAL-true
Dma.SDMMC1_TX.3.PeriphInc=DMA_PINC_DISABLE
Dma.SPI1_TX.1.PeriphInc=DMA_PINC_DISABLE
PA11.Mode=Device_Only
PA0/WKUP.Signal=UART4_TX
PC14/OSC32_IN.Mode=LSE-External-Oscillator
RCC.PLLI2SRCLKFreq_Value=192000000
RCC.USART2Freq_Value=54000000
PG11.Signal=DCMI_D3
ProjectManager.StackSize=0x400
RCC.I2C3Freq_Value=54000000
Mcu.IP4=DMA
Mcu.IP5=FATFS
RCC.FCLKCortexFreq_Value=216000000
I2C1.IPParameters=Timing
Mcu.IP2=CORTEX_M7
Mcu.IP3=DCMI
PA15.GPIO_Label=DCMI_RWDN
Mcu.IP0=CAN1
Mcu.IP1=CAN2
PA12.Signal=USB_OTG_FS_DP
Mcu.UserConstants=
SPI4.Mode=SPI_MODE_MASTER
RCC.SDMMCFreq_Value=48000000
Mcu.ThirdPartyNb=0
PH0/OSC_IN.Mode=HSE-External-Oscillator
RCC.HCLKFreq_Value=216000000
Mcu.IPNb=18
RCC.PLLI2SRoutputFreq_Value=192000000
ProjectManager.PreviousToolchain=
RCC.SPDIFRXFreq_Value=192000000
Dma.SDMMC1_TX.3.Mode=DMA_PFCTRL
Mcu.Pin6=PH0/OSC_IN
Mcu.Pin7=PH1/OSC_OUT
NVIC.DMA2_Stream0_IRQn=true\:0\:0\:false\:false\:true\:false\:true
Mcu.Pin8=PA0/WKUP
Mcu.Pin9=PA1
RCC.VCOSAIOutputFreq_Value=100000000
SPI4.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,BaudRatePrescaler
RCC.AHBFreq_Value=216000000
Mcu.Pin0=PE2
Mcu.Pin1=PE4
GPIO.groupedBy=
Mcu.Pin2=PE5
Mcu.Pin3=PE6
Mcu.Pin4=PC14/OSC32_IN
Mcu.Pin5=PC15/OSC32_OUT
RCC.HSE_VALUE=8000000
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.IP10=SDMMC1
USART2.VirtualMode-Asynchronous=VM_ASYNC
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
Mcu.IP12=SPI4
Mcu.IP11=SPI1
Mcu.IP17=USB_OTG_FS
Mcu.IP14=UART4
PB4.Mode=Full_Duplex_Master
Mcu.IP13=SYS
PE13.Signal=SPI4_MISO
Mcu.IP16=USART2
Mcu.IP15=USART1
RCC.VCOInputFreq_Value=2000000
PA14.Mode=Serial_Wire
File.Version=6
PB7.Signal=USART1_RX
PE4.Mode=Slave_8_bits_External_Synchro
PE4.Signal=DCMI_D4
PH1/OSC_OUT.Mode=HSE-External-Oscillator
Dma.RequestsNb=4
SPI4.BaudRatePrescaler=SPI_BAUDRATEPRESCALER_2
ProjectManager.ProjectName=afina_dev
PF15.Mode=I2C
PA6.Signal=DCMI_PIXCLK
PB12.Mode=CAN_Activate
CAN2.BS1=CAN_BS1_2TQ
CAN2.BS2=CAN_BS2_2TQ
PC14/OSC32_IN.Signal=RCC_OSC32_IN
PD5.GPIO_Label=SDIO_DET
ProjectManager.ToolChainLocation=
RCC.LSI_VALUE=32000
USB_OTG_FS.VirtualMode=Device_Only
PA15.Signal=GPIO_Output
RCC.PLLSAIN=50
Dma.Request2=SDMMC1_RX
Dma.Request1=SPI1_TX
Dma.Request3=SDMMC1_TX
Dma.Request0=SPI1_RX
SPI1.BaudRatePrescaler=SPI_BAUDRATEPRESCALER_2
PB3.Locked=true
PB4.Signal=SPI1_MISO
PA3.Signal=USART2_RX
Dma.SDMMC1_TX.3.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode,FIFOThreshold,MemBurst,PeriphBurst
RCC.I2SFreq_Value=192000000
Dma.SPI1_TX.1.MemInc=DMA_MINC_ENABLE
PA7.Mode=Full_Duplex_Master
RCC.UART7Freq_Value=54000000
ProjectManager.NoMain=false
SPI1.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,BaudRatePrescaler
PC11.Signal=SDMMC1_D3
PC8.Signal=SDMMC1_D0
PC10.Mode=SD_4_bits_Wide_bus
PG10.Mode=Slave_8_bits_External_Synchro
ProjectManager.DefaultFWLocation=true
PD5.Signal=GPIO_Output
Dma.SDMMC1_RX.2.MemBurst=DMA_MBURST_INC4
ProjectManager.DeletePrevious=true
Dma.SPI1_RX.0.Mode=DMA_NORMAL
RCC.LCDTFToutputFreq_Value=25000000
Dma.SPI1_TX.1.Direction=DMA_MEMORY_TO_PERIPH
Dma.SDMMC1_RX.2.PeriphInc=DMA_PINC_DISABLE
RCC.FamilyName=M
Dma.SDMMC1_RX.2.Mode=DMA_PFCTRL
FATFS0.BSP.instance=PB3
FATFS.IPParameters=USE_DMA_CODE_SD
USART1.VirtualMode-Asynchronous=VM_ASYNC
PA13.Signal=SYS_JTMS-SWDIO
Dma.SPI1_RX.0.FIFOMode=DMA_FIFOMODE_DISABLE
PA9.Mode=Activate_VBUS
CAN1.BS2=CAN_BS2_2TQ
CAN1.BS1=CAN_BS1_2TQ
ProjectManager.TargetToolchain=Makefile
FATFS0.BSP.condition=
PB9.Mode=I2C
ProjectManager.RegisterCallBack=
RCC.USBFreq_Value=48000000
NVIC.DMA2_Stream3_IRQn=true\:0\:0\:false\:false\:true\:false\:true
RCC.PLLSAIoutputFreq_Value=50000000
PA1.Signal=UART4_RX
Dma.SDMMC1_TX.3.Instance=DMA2_Stream6
RCC.VCOI2SOutputFreq_Value=384000000
PD2.Mode=SD_4_bits_Wide_bus
DCMI.IPParameters=JPEGMode
Dma.SDMMC1_RX.2.Priority=DMA_PRIORITY_LOW
RCC.PLLSAIPCLKFreq_Value=50000000
board=custom
RCC.VCOOutputFreq_Value=432000000
Dma.SDMMC1_TX.3.Direction=DMA_MEMORY_TO_PERIPH
FATFS.USE_DMA_CODE_SD=1
PH0/OSC_IN.Signal=RCC_OSC_IN
RCC.APB2Freq_Value=108000000
RCC.UART4Freq_Value=54000000
MxCube.Version=6.1.2
PD4.GPIO_Label=DCMI_RST
Dma.SPI1_RX.0.Instance=DMA2_Stream0
PE14.Mode=Full_Duplex_Master
PF14.Mode=I2C
PE5.Mode=Slave_8_bits_External_Synchro
NVIC.DMA2_Stream5_IRQn=true\:0\:0\:false\:false\:true\:false\:true
VP_SYS_VS_Systick.Mode=SysTick
PD4.GPIOParameters=GPIO_Label
CAN2.CalculateTimeQuantum=296.2962962962963
Dma.SPI1_RX.0.MemDataAlignment=DMA_MDATAALIGN_BYTE
PF15.Signal=I2C4_SDA
SPI4.CalculateBaudRate=54.0 MBits/s
PE6.Signal=DCMI_D7
RCC.UART5Freq_Value=54000000
RCC.IPParameters=AHBFreq_Value,APB1CLKDivider,APB1Freq_Value,APB1TimFreq_Value,APB2CLKDivider,APB2Freq_Value,APB2TimFreq_Value,CECFreq_Value,CortexFreq_Value,EthernetFreq_Value,FCLKCortexFreq_Value,FamilyName,HCLKFreq_Value,HSE_VALUE,HSI_VALUE,I2C1Freq_Value,I2C2Freq_Value,I2C3Freq_Value,I2C4Freq_Value,I2SFreq_Value,LCDTFToutputFreq_Value,LPTIM1Freq_Value,LSI_VALUE,MCO2PinFreq_Value,PLLCLKFreq_Value,PLLI2SPCLKFreq_Value,PLLI2SQCLKFreq_Value,PLLI2SRCLKFreq_Value,PLLI2SRoutputFreq_Value,PLLM,PLLN,PLLQ,PLLQCLKFreq_Value,PLLQoutputFreq_Value,PLLSAIN,PLLSAIPCLKFreq_Value,PLLSAIQCLKFreq_Value,PLLSAIRCLKFreq_Value,PLLSAIoutputFreq_Value,RNGFreq_Value,SAI1Freq_Value,SAI2Freq_Value,SDMMCClockSelection,SDMMCFreq_Value,SPDIFRXFreq_Value,SYSCLKFreq_VALUE,SYSCLKSource,UART4Freq_Value,UART5Freq_Value,UART7Freq_Value,UART8Freq_Value,USART1Freq_Value,USART2Freq_Value,USART3Freq_Value,USART6Freq_Value,USBFreq_Value,VCOI2SOutputFreq_Value,VCOInputFreq_Value,VCOOutputFreq_Value,VCOSAIOutputFreq_Value
ProjectManager.AskForMigrate=true
Mcu.Name=STM32F746ZGTx
PD0.Mode=CAN_Activate
Dma.SPI1_RX.0.MemInc=DMA_MINC_ENABLE
PA2.Signal=USART2_TX
Mcu.IP8=NVIC
Mcu.IP9=RCC
Mcu.IP6=I2C1
Mcu.IP7=I2C4
ProjectManager.CoupleFile=true
PB3.Signal=GPIO_Input
RCC.SYSCLKFreq_VALUE=216000000
PA12.Mode=Device_Only
KeepUserPlacement=false
PC15/OSC32_OUT.Mode=LSE-External-Oscillator
PB7.Mode=Asynchronous
PA14.Signal=SYS_JTCK-SWCLK
RCC.HSI_VALUE=16000000
RCC.PLLQ=9
FATFS0.BSP.component=
RCC.PLLM=4
RCC.PLLN=216
PB7.Locked=true
PA2.Mode=Asynchronous
PB8.Signal=I2C1_SCL
PC9.Signal=SDMMC1_D1
PC7.Mode=Slave_8_bits_External_Synchro
RCC.APB1Freq_Value=54000000
ProjectManager.DeviceId=STM32F746ZGTx
PB12.Signal=CAN2_RX
ProjectManager.LibraryCopy=0
Dma.SDMMC1_RX.2.FIFOThreshold=DMA_FIFO_THRESHOLD_FULL
I2C4.IPParameters=Timing
PA7.Signal=SPI1_MOSI
